app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" ORDER BY ratingstwo DESC LIMIT $1  [["LIMIT", 10]]
SELECT "artists".* FROM "artists" ORDER BY distancetwo LIMIT $1  [["LIMIT", 20]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."artist_id" = $1  [["artist_id", 6]]
SELECT "artists".* FROM "artists" ORDER BY ratingstwo LIMIT $1  [["LIMIT", 12]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."artist_id" = $1  [["artist_id", 8]]
---
  def index

    if params[:ratings] == "sorted"
      @artists = Artist.all.order('ratingstwo DESC').limit(10)
      render json: @artists.to_json(include: :portfolios)
    elsif params[:distance] == "sorted"
      @artists = Artist.all.reorder('distancetwo').limit(20)
      render json: @artists.to_json(include: :portfolios)
    else
      @artists = Artist.all.reorder('ratingstwo').limit(12)